benchmark/500k-large-groups/map/wrk2/map-t1-c1-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 19.619ms, rate sampling interval: 87ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.09ms  115.58ms 884.74ms   95.24%
    Req/Sec     1.93k   430.50     2.62k    69.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.90ms
 75.000%   39.65ms
 90.000%   72.19ms
 99.000%  697.34ms
 99.900%  869.38ms
 99.990%  884.73ms
 99.999%  885.25ms
100.000%  885.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.333     0.000000            1         1.00
       1.425     0.100000         3832         1.11
       4.223     0.200000         7665         1.25
       9.359     0.300000        11496         1.43
      15.871     0.400000        15321         1.67
      21.903     0.500000        19154         2.00
      25.295     0.550000        21078         2.22
      28.591     0.600000        22981         2.50
      32.319     0.650000        24901         2.86
      35.839     0.700000        26829         3.33
      39.647     0.750000        28735         4.00
      41.823     0.775000        29693         4.44
      44.959     0.800000        30645         5.00
      48.415     0.825000        31603         5.71
      54.367     0.850000        32558         6.67
      63.135     0.875000        33514         8.00
      68.223     0.887500        33996         8.89
      72.191     0.900000        34475        10.00
      76.863     0.912500        34952        11.43
      92.031     0.925000        35429        13.33
     122.175     0.937500        35908        16.00
     136.191     0.943750        36147        17.78
     144.895     0.950000        36392        20.00
     213.119     0.956250        36628        22.86
     305.151     0.962500        36870        26.67
     387.327     0.968750        37109        32.00
     462.335     0.971875        37225        35.56
     507.391     0.975000        37348        40.00
     516.863     0.978125        37467        45.71
     574.975     0.981250        37585        53.33
     649.215     0.984375        37708        64.00
     661.503     0.985938        37768        71.11
     671.743     0.987500        37829        80.00
     686.591     0.989062        37886        91.43
     718.847     0.990625        37944       106.67
     729.599     0.992188        38002       128.00
     755.199     0.992969        38032       142.22
     779.775     0.993750        38062       160.00
     806.911     0.994531        38092       182.86
     822.271     0.995313        38123       213.33
     845.311     0.996094        38153       256.00
     847.871     0.996484        38169       284.44
     848.895     0.996875        38183       320.00
     852.991     0.997266        38203       365.71
     855.551     0.997656        38213       426.67
     857.087     0.998047        38241       512.00
     857.087     0.998242        38241       568.89
     858.111     0.998437        38242       640.00
     859.647     0.998633        38249       731.43
     862.719     0.998828        38257       853.33
     869.887     0.999023        38264      1024.00
     872.447     0.999121        38268      1137.78
     876.543     0.999219        38272      1280.00
     881.663     0.999316        38275      1462.86
     882.687     0.999414        38279      1706.67
     883.199     0.999512        38285      2048.00
     883.199     0.999561        38285      2275.56
     884.223     0.999609        38292      2560.00
     884.223     0.999658        38292      2925.71
     884.223     0.999707        38292      3413.33
     884.223     0.999756        38292      4096.00
     884.735     0.999780        38298      4551.11
     884.735     0.999805        38298      5120.00
     884.735     0.999829        38298      5851.43
     884.735     0.999854        38298      6826.67
     884.735     0.999878        38298      8192.00
     884.735     0.999890        38298      9102.22
     884.735     0.999902        38298     10240.00
     884.735     0.999915        38298     11702.86
     885.247     0.999927        38301     13653.33
     885.247     1.000000        38301          inf
#[Mean    =       49.087, StdDeviation   =      115.581]
#[Max     =      884.736, Total count    =        38301]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58232 requests in 30.00s, 11.33MB read
Requests/sec:   1941.08
Transfer/sec:    386.70KB