benchmark/500k-large-groups/map/wrk2/map-t1-c1-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 14.494ms, rate sampling interval: 65ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.05ms   15.33ms 102.14ms   86.30%
    Req/Sec     2.01k   405.78     2.65k    71.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.16ms
 75.000%   23.55ms
 90.000%   33.47ms
 99.000%   79.10ms
 99.900%   99.39ms
 99.990%  102.01ms
 99.999%  102.21ms
100.000%  102.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.325     0.000000            1         1.00
       0.994     0.100000         3999         1.11
       1.527     0.200000         8001         1.25
       3.155     0.300000        11993         1.43
       6.759     0.400000        15988         1.67
      11.159     0.500000        19988         2.00
      13.695     0.550000        21989         2.22
      16.167     0.600000        23984         2.50
      18.671     0.650000        25988         2.86
      21.103     0.700000        27983         3.33
      23.551     0.750000        29980         4.00
      24.879     0.775000        30984         4.44
      26.127     0.800000        31977         5.00
      27.711     0.825000        32983         5.71
      29.391     0.850000        33982         6.67
      31.263     0.875000        34976         8.00
      32.255     0.887500        35474         8.89
      33.503     0.900000        35987        10.00
      34.783     0.912500        36475        11.43
      35.967     0.925000        36985        13.33
      37.663     0.937500        37476        16.00
      38.815     0.943750        37726        17.78
      39.967     0.950000        37977        20.00
      41.695     0.956250        38224        22.86
      42.943     0.962500        38477        26.67
      45.119     0.968750        38720        32.00
      46.815     0.971875        38845        35.56
      51.135     0.975000        38971        40.00
      53.887     0.978125        39095        45.71
      57.023     0.981250        39220        53.33
      59.679     0.984375        39345        64.00
      67.647     0.985938        39407        71.11
      73.663     0.987500        39471        80.00
      78.399     0.989062        39533        91.43
      79.999     0.990625        39595       106.67
      82.431     0.992188        39657       128.00
      84.031     0.992969        39688       142.22
      86.655     0.993750        39720       160.00
      89.151     0.994531        39751       182.86
      91.519     0.995313        39782       213.33
      94.015     0.996094        39814       256.00
      94.463     0.996484        39830       284.44
      94.975     0.996875        39847       320.00
      95.359     0.997266        39861       365.71
      95.743     0.997656        39876       426.67
      96.383     0.998047        39893       512.00
      96.831     0.998242        39899       568.89
      97.535     0.998437        39907       640.00
      98.239     0.998633        39915       731.43
      99.007     0.998828        39923       853.33
      99.519     0.999023        39930      1024.00
      99.775     0.999121        39934      1137.78
      99.967     0.999219        39939      1280.00
     100.351     0.999316        39942      1462.86
     100.799     0.999414        39946      1706.67
     101.247     0.999512        39950      2048.00
     101.375     0.999561        39953      2275.56
     101.503     0.999609        39954      2560.00
     101.567     0.999658        39957      2925.71
     101.631     0.999707        39959      3413.33
     101.695     0.999756        39960      4096.00
     101.759     0.999780        39961      4551.11
     101.823     0.999805        39962      5120.00
     101.887     0.999829        39963      5851.43
     101.951     0.999854        39964      6826.67
     102.015     0.999878        39965      8192.00
     102.015     0.999890        39965      9102.22
     102.143     0.999902        39967     10240.00
     102.143     0.999915        39967     11702.86
     102.143     0.999927        39967     13653.33
     102.143     0.999939        39967     16384.00
     102.143     0.999945        39967     18204.44
     102.207     0.999951        39969     20480.00
     102.207     1.000000        39969          inf
#[Mean    =       15.049, StdDeviation   =       15.330]
#[Max     =      102.144, Total count    =        39969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59978 requests in 30.00s, 11.67MB read
Requests/sec:   1999.29
Transfer/sec:    398.30KB