benchmark/500k-large-groups/map/wrk2/map-t2-c20-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  2 threads and 20 connections
  Thread calibration: mean lat.: 3.248ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.302ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.90ms   17.12ms 136.06ms   89.15%
    Req/Sec     1.04k   343.25     3.46k    75.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.87ms
 75.000%    8.49ms
 90.000%   29.57ms
 99.000%   85.76ms
 99.900%  113.92ms
 99.990%  127.42ms
 99.999%  136.19ms
100.000%  136.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.377     0.000000            1         1.00
       1.097     0.100000         4000         1.11
       1.470     0.200000         7987         1.25
       1.826     0.300000        11975         1.43
       2.239     0.400000        15971         1.67
       2.867     0.500000        19956         2.00
       3.389     0.550000        21947         2.22
       4.139     0.600000        23940         2.50
       5.107     0.650000        25935         2.86
       6.503     0.700000        27932         3.33
       8.487     0.750000        29925         4.00
       9.871     0.775000        30931         4.44
      11.815     0.800000        31920         5.00
      14.367     0.825000        32918         5.71
      17.679     0.850000        33916         6.67
      22.703     0.875000        34914         8.00
      25.823     0.887500        35412         8.89
      29.567     0.900000        35910        10.00
      33.567     0.912500        36411        11.43
      38.463     0.925000        36910        13.33
      43.839     0.937500        37408        16.00
      46.943     0.943750        37658        17.78
      49.887     0.950000        37907        20.00
      52.767     0.956250        38155        22.86
      56.319     0.962500        38406        26.67
      60.191     0.968750        38654        32.00
      62.591     0.971875        38778        35.56
      65.151     0.975000        38904        40.00
      68.095     0.978125        39028        45.71
      71.551     0.981250        39153        53.33
      75.839     0.984375        39277        64.00
      77.631     0.985938        39339        71.11
      81.023     0.987500        39403        80.00
      83.711     0.989062        39467        91.43
      87.039     0.990625        39526       106.67
      90.047     0.992188        39589       128.00
      92.031     0.992969        39620       142.22
      93.631     0.993750        39651       160.00
      95.487     0.994531        39683       182.86
      97.983     0.995313        39714       213.33
     100.671     0.996094        39745       256.00
     102.591     0.996484        39760       284.44
     104.447     0.996875        39776       320.00
     106.431     0.997266        39791       365.71
     108.287     0.997656        39807       426.67
     110.015     0.998047        39823       512.00
     111.039     0.998242        39830       568.89
     111.359     0.998437        39838       640.00
     112.639     0.998633        39846       731.43
     113.407     0.998828        39854       853.33
     114.111     0.999023        39862      1024.00
     114.623     0.999121        39865      1137.78
     114.879     0.999219        39869      1280.00
     115.711     0.999316        39873      1462.86
     116.479     0.999414        39877      1706.67
     117.375     0.999512        39881      2048.00
     117.695     0.999561        39883      2275.56
     119.359     0.999609        39885      2560.00
     120.255     0.999658        39887      2925.71
     120.959     0.999707        39889      3413.33
     124.351     0.999756        39891      4096.00
     125.503     0.999780        39892      4551.11
     125.823     0.999805        39893      5120.00
     126.783     0.999829        39894      5851.43
     127.231     0.999854        39895      6826.67
     127.423     0.999878        39896      8192.00
     127.423     0.999890        39896      9102.22
     128.127     0.999902        39897     10240.00
     128.127     0.999915        39897     11702.86
     131.839     0.999927        39898     13653.33
     131.839     0.999939        39898     16384.00
     131.839     0.999945        39898     18204.44
     133.503     0.999951        39899     20480.00
     133.503     0.999957        39899     23405.71
     133.503     0.999963        39899     27306.67
     133.503     0.999969        39899     32768.00
     133.503     0.999973        39899     36408.89
     136.191     0.999976        39900     40960.00
     136.191     1.000000        39900          inf
#[Mean    =        9.896, StdDeviation   =       17.123]
#[Max     =      136.064, Total count    =        39900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59963 requests in 30.00s, 11.67MB read
Requests/sec:   1998.52
Transfer/sec:    398.14KB